# BendingDetailTypeBendDiameterDimensionsForHooksEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BendingDetailTypeBendDiameterDimensionsForHooksEnabled Property
ParameterTypeId Class See Also
---
"Hook Bends"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BendingDetailTypeBendDiameterDimensionsForHooksEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BendingDetailTypeBendDiameterDimensionsForHooksEnabled As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BendingDetailTypeBendDiameterDimensionsForHooksEnabled {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace